import json, requests

rowKey = input('请输入社会统一信用代码:')
# region = [
#     {
#         "x": "华东",
#         "y": 3388752319.96,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "华南",
#         "y": 1724559300.69,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "华中",
#         "y": 1148579102.64,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "华北",
#         "y": 1123463666.06,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "西北",
#         "y": 558881746.91,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "西南",
#         "y": 1094757527.52,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "东北",
#         "y": 303803565.79,
#         "s": "营业收入",
#         "z": ""
#     },
#     {
#         "x": "海外",
#         "y": 757318576.39,
#         "s": "营业收入",
#         "z": ""
#     },
# {
#         "x": "华东",
#         "y": 2820229145.76,
#         "s": "营业成本",
#         "z": 16.78
#     },
#     {
#         "x": "华南",
#         "y": 1490228684.89,
#         "s": "营业成本",
#         "z": 13.59
#     },
#     {
#         "x": "华中",
#         "y": 1006815166.93,
#         "s": "营业成本",
#         "z": 12.34
#     },
#     {
#         "x": "华北",
#         "y": 968157265.94,
#         "s": "营业成本",
#         "z": 13.82
#     },
#     {
#         "x": "西北",
#         "y": 478987038.40,
#         "s": "营业成本",
#         "z": 14.30
#     },
#     {
#         "x": "西南",
#         "y": 981094405.39,
#         "s": "营业成本",
#         "z": 10.38
#     },
#     {
#         "x": "东北",
#         "y":  269480866.61 ,
#         "s": "营业成本",
#         "z": 11.31
#     },
#     {
#         "x": "海外",
#         "y": 597072449.26,
#         "s": "营业成本",
#         "z": 21.6
#     },
# ]
region = [
    {
        "x": "国内",
        "y": 10720975032,
        "s": "营业收入",
        "z": ""
    },
    {
        "x": "国外",
        "y": 33943353.61,
        "s": "营业收入",
        "z": ""
    },
    {
        "x": "国内",
        "y": 9199165761,
        "s": "营业成本",
        "z": 14.19
    },
    {
        "x": "国外",
        "y": 27752085.87,
        "s": "营业成本",
        "z": 18.24
    }
]

region = json.dumps(region, ensure_ascii=False)
data = json.dumps({"tableName": "company", "dataList": [{'rowKey': rowKey, 'region': region}]},
                  ensure_ascii=False)
s_url = 'http://47.113.200.109:3012/digital-oc/dataset/data/list/'  # hb接口
header = {'Content-Type': 'application/json;charset=utf-8'}
res = requests.post(s_url, data=data.encode('utf-8'), headers=header)
print(res.status_code)
print(data)
