import requests, json

code = input('请输入社会信用统一代码:')
# result = [ # 安徽鸿路
#     {
#         "项目名称": "智慧城市停车系统及绿色建筑制造基地项目",
#         "项目金额": "17,936,267.19"
#     },
#     {
#         "项目名称": "南川工业园区产业孵化园定制化厂房项目",
#         "项目金额": "89,145,009.31"
#     },
#     {
#         "项目名称": "绿色建筑产业现代化项目",
#         "项目金额": "9,459,000.00"
#     },
#     {
#         "项目名称": "智能化制造技改项目",
#         "项目金额": "276,000.00"
#     },
#     {
#         "项目名称": "重庆金鸿纬厂房及附属工程",
#         "项目金额": "36,906,301.14"
#     },
#     {
#         "项目名称": "鸿路涡阳绿色装配式建筑产业园(三期)",
#         "项目金额": "111,152,664.21"
#     },
#     {
#         "项目名称": "绿色装配式建筑总部产业基地一期项目",
#         "项目金额": "64,421,961.49"
#     },
#     {
#         "项目名称": "颍上盛鸿建筑科技有限公司装配式建筑产业项目",
#         "项目金额": "1,158,182.36"
#     },
# ] #
# result = [  # 中铁高新
#     {
#         "项目名称": "重载高锰钢辙叉生产基地项目",
#         "项目金额": "167,457,124.33"
#     },
#     {
#         "项目名称": "中国中铁智能化高端装备产业园项目",
#         "项目金额": "99,618,982.88"
#     },
#     {
#         "项目名称": "悬挂式空中轨道列车项目",
#         "项目金额": "40,341,713.08"
#     },
#     {
#         "项目名称": "B地块道岔厂房生产项目建设",
#         "项目金额": "37,049,530.39"
#     },
#     {
#         "项目名称": "宝桥综合管理中心项目",
#         "项目金额": "35,398,053.61"
#     },
#     {
#         "项目名称": "九桥智能制造车间项目",
#         "项目金额": "28,557,451.62"
#     },
#     {
#         "项目名称": "中铁新型高速重载道岔研发中心项目一期工程",
#         "项目金额": "28,214,173.80"
#     },
# ]
# result = [  # 东南网架
#     {
#         '项目名称': '年产 3.3 万吨抗紫外、阻燃',
#         '项目金额': '1,666,300.61'
#     },
#     {
#         '项目名称': '装配式钢结构',
#         '项目金额': '274,279,830.90'
#     },
#     {
#         '项目名称': '建筑基地零星工程',
#         '项目金额': '45,248,975.76'
#     },
# ]
# result = [  # 精工钢构
#     {
#         '项目名称': '海南国际会展中心二期扩建项目钢结构专业工程第二标段制作及安装施工工程',
#         '业务模式': '设计施工合同',
#         '项目金额': '180000000'
#     },
#     {
#         '项目名称': '那曲生态长廊',
#         '业务模式': '设计施工合同',
#         '项目金额': '289104600'
#     },
#     {
#         '项目名称': '绍兴国际会展中心一期B区EPC工程',
#         '业务模式': '设计施工合同',
#         '项目金额': '2350000000'
#     }
# ]
result = [  # 安徽富煌
    {
        '项目名称': '装配式建筑生产基地钢构安装工程',
        '项目金额': '19,882,532.28'
    },
    {
        '项目名称': '富煌百城厂区改造',
        '项目金额': '1,017,823.81'
    },
]
s_url = 'http://47.113.200.109:3012/digital-oc/dataset/data/list/'  # hb接口
header = {'Content-Type': 'application/json;charset=utf-8'}
result = json.dumps(result, ensure_ascii=False)
data = json.dumps({"tableName": "company", "dataList": [{'rowKey': code, 'project': result}]}, indent=2,
                  ensure_ascii=False)
res = requests.post(s_url, data=data.encode('utf-8'), headers=header)
print(res.status_code)
