def city_pr(c):
    city_provinces = '辽宁省沈阳市 吉林省长春市 黑龙江省哈尔滨市 江苏省南京市 湖北省武汉市 ' \
                     '广东省广州市 四川省成都市 陕西省西安市 河北省石家庄市 河北省唐山市 山西省太原市 ' \
                     '内蒙包头市 辽宁省大连市 辽宁省鞍山市 辽宁省抚顺市 吉林省吉林市 黑龙江省齐齐哈尔市 ' \
                     '江苏省徐州市 浙江省杭州市 福建省福州市 江西省南昌市 山东省济南市 山东省青岛市 ' \
                     '山东省淄博市 河南省郑州市 湖南省长沙市 贵州省贵阳市 云南省昆明市 甘肃省兰州市 新疆乌鲁木齐市 ' \
                     '河北省邯郸市 河北省保定市 河北省张家口市 山西省大同市 内蒙呼和浩特市 辽宁省本溪市 ' \
                     '辽宁省丹东市 辽宁省锦州市 辽宁省阜新市 辽宁省辽阳市 黑龙江省鸡西市 黑龙江省鹤岗市 ' \
                     '黑龙江省大庆市 黑龙江省伊春市 黑龙江省佳木斯市 黑龙江省牡丹江市 江苏省无锡市 ' \
                     '江苏省常州市 江苏省苏州市 浙江省宁波市 安徽省合肥市 安徽省淮南市 安徽省淮北市 ' \
                     '福建省厦门市 山东省枣庄市 山东省烟台市 山东省潍坊市 山东省泰安市 山东省临沂市 ' \
                     '河南省开封市 河南省洛阳市 河南省平顶山市 河南省安阳市 河南省新乡市 河南省焦作市 ' \
                     '湖北省黄石市 湖北省襄樊市 湖北省荆州市 湖南省株洲市 湖南省湘潭市 湖南省衡阳市 ' \
                     '广东省深圳市 广东省汕头市 广东省湛江市 广西南宁市 广西柳州市 青海省西宁市 ' \
                     '河北省秦皇岛市 河北省邢台市 河北省承德市 河北省沧州市 河北省廊坊市 河北省衡水市 ' \
                     '山西省阳泉市 山西省长治市 内蒙乌海市 内蒙赤峰市 辽宁省营口市 辽宁省盘锦市 ' \
                     '辽宁省铁岭市 辽宁省朝阳市 辽宁省葫芦岛市 吉林省四平市 吉林省辽源市 吉林省通化市 ' \
                     '吉林省白山市 吉林省松原市 吉林省白城市 黑龙江省双鸭山市 黑龙江省七台河市 ' \
                     '江苏省南通市 江苏省连云港市 江苏省淮阴市 江苏省盐城市 江苏省扬州市 江苏省镇江市 ' \
                     '江苏省泰州市 浙江省温州市 浙江省嘉兴市 浙江省湖州市 浙江省绍兴市 浙江省台州市 ' \
                     '安徽省芜湖市 安徽省蚌埠市 安徽省马鞍山市 安徽省铜陵市 安徽省安庆市 安徽省阜阳市 ' \
                     '福建省泉州市 福建省漳州市 福建省南平市 福建省龙岩市 江西省景德镇市 江西省萍乡市 ' \
                     '江西省九江市 江西省新余市 山东省东营市 山东省济宁市 山东省威海市 山东省日照市 ' \
                     '山东省莱芜市 山东省德州市 河南省鹤壁市 河南省濮阳市 河南省许昌市 河南省漯河市 ' \
                     '河南省南阳市 河南省商丘市 湖北省十堰市 湖北省宜昌市 湖北省鄂州市 湖北省荆门市 ' \
                     '湖北省孝感市 湖北省黄冈市 湖南省邵阳市 湖南省岳阳市 湖南省常德市 湖南省益阳市 ' \
                     '湖南省郴州市 湖南省永州市 湖南省怀化市 广东省韶关市 广东省珠海市 广东省佛山市 ' \
                     '广东省江门市 广东省茂名市 广东省肇庆市 广东省惠州市 广东省梅州市 广东省阳江市 ' \
                     '广东省东莞市 广东省中山市 广东省潮州市 广西桂林市 广西梧州市 广西贵港市 ' \
                     '海南省海口市 四川省自贡市 四川省攀枝花市 四川省泸州市 四川省德阳市 四川省绵阳市 ' \
                     '四川省广元市 四川省遂宁市 四川省内江市 四川省乐山市 四川省南充市 四川省宜宾市 ' \
                     '贵州省六盘水市 贵州省遵义市 云南省曲靖市 陕西省铜川市 陕西省宝鸡市 陕西省咸阳市 ' \
                     '陕西省汉中市 甘肃省白银市 甘肃省天水市 宁夏银川市 宁夏石嘴山市 新疆克拉玛依市 ' \
                     '山西省晋城市 山西省朔州市 内蒙通辽市 黑龙江省黑河市 江苏省宿迁市 浙江省金华市 ' \
                     '浙江省衢州市 浙江省舟山市 安徽省黄山市 安徽省滁州市 安徽省宿州市 安徽省巢湖市 ' \
                     '安徽省六安市 福建省莆田市 福建省三明市 江西省鹰潭市 江西省赣州市 山东省聊城市 ' \
                     '河南省三门峡市 河南省信阳市 湖北省咸宁市 湖南省张家界市 湖南省娄底市 广东省汕尾市 ' \
                     '广东省河源市 广东省清远市 广东省揭阳市 广东省云浮市 广西北海市 广西防城港市 ' \
                     '广西钦州市 广西玉林市 海南省三亚市 四川省达州市 云南省玉溪市 陕西省渭南市 ' \
                     '陕西省延安市 陕西省榆林市 甘肃省嘉峪关市 甘肃省金昌市 宁夏吴忠市'
    city_provinces = city_provinces.split(' ')
    city_prov = {'北京市': '北京', '上海市': '上海', '天津市': '天津', '重庆市': '重庆'}
    for city in city_provinces:
        l = city.split('省')
        if len(l) == 1:
            city_prov[city[0][-3:]] = city[0][:-3]
            continue
        v, k = l
        city_prov[k] = v
    return city_prov[c]


city = input('请输入城市名:')
print(city_pr(city))
